Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.Unknown


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.CertificateCommonNameIsIncorrect


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.CertificateExpired


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.ClientCertificateContainsErrors


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.CertificateRevoked


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.CertificateIsInvalid


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.ServerUnreachable


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.Timeout


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.ErrorHttpInvalidServerResponse


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.ConnectionAborted


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.ConnectionReset


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.Disconnected


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.CannotConnect


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.HostNameNotResolved


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.OperationCanceled


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.RedirectFailed


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.UnexpectedError


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.ValidAuthenticationCredentialsRequired


Autodesk.Navisworks.Api.Plugins.HomeScreenErrorStatus.ValidProxyAuthenticationRequired
